src/main/java/ru/vk/itmo/test/abramovilya/wrk/results/stage2/t4_c800_R22000_qs200.txt
.Running 2m test @ http://localhost:8080
  4 threads and 800 connections
  Thread calibration: mean lat.: 1.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.057ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.717ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.20ms  611.42us   6.90ms   70.46%
    Req/Sec     5.83k     3.85k   22.22k    79.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.54ms
 90.000%    1.96ms
 99.000%    3.15ms
 99.900%    3.85ms
 99.990%    4.70ms
 99.999%    5.76ms
100.000%    6.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       0.470     0.100000       306194         1.11
       0.667     0.200000       611673         1.25
       0.837     0.300000       918094         1.43
       0.991     0.400000      1224108         1.67
       1.141     0.500000      1529719         2.00
       1.217     0.550000      1683211         2.22
       1.293     0.600000      1835050         2.50
       1.371     0.650000      1989007         2.86
       1.451     0.700000      2142263         3.33
       1.537     0.750000      2294026         4.00
       1.585     0.775000      2370637         4.44
       1.639     0.800000      2447378         5.00
       1.700     0.825000      2523712         5.71
       1.771     0.850000      2600215         6.67
       1.857     0.875000      2676028         8.00
       1.908     0.887500      2714670         8.89
       1.964     0.900000      2752365        10.00
       2.029     0.912500      2790899        11.43
       2.105     0.925000      2829074        13.33
       2.197     0.937500      2867482        16.00
       2.251     0.943750      2886738        17.78
       2.311     0.950000      2905381        20.00
       2.383     0.956250      2924649        22.86
       2.467     0.962500      2943503        26.67
       2.569     0.968750      2962520        32.00
       2.629     0.971875      2972112        35.56
       2.695     0.975000      2981825        40.00
       2.769     0.978125      2991315        45.71
       2.855     0.981250      3000910        53.33
       2.953     0.984375      3010368        64.00
       3.005     0.985938      3015109        71.11
       3.059     0.987500      3020004        80.00
       3.113     0.989062      3024726        91.43
       3.169     0.990625      3029483       106.67
       3.231     0.992188      3034302       128.00
       3.263     0.992969      3036598       142.22
       3.297     0.993750      3038972       160.00
       3.337     0.994531      3041470       182.86
       3.379     0.995313      3043789       213.33
       3.431     0.996094      3046208       256.00
       3.459     0.996484      3047408       284.44
       3.489     0.996875      3048563       320.00
       3.525     0.997266      3049769       365.71
       3.569     0.997656      3050919       426.67
       3.627     0.998047      3052120       512.00
       3.661     0.998242      3052727       568.89
       3.699     0.998437      3053331       640.00
       3.745     0.998633      3053926       731.43
       3.793     0.998828      3054516       853.33
       3.857     0.999023      3055099      1024.00
       3.893     0.999121      3055411      1137.78
       3.931     0.999219      3055704      1280.00
       3.971     0.999316      3055997      1462.86
       4.021     0.999414      3056301      1706.67
       4.077     0.999512      3056594      2048.00
       4.115     0.999561      3056757      2275.56
       4.155     0.999609      3056895      2560.00
       4.207     0.999658      3057044      2925.71
       4.255     0.999707      3057195      3413.33
       4.315     0.999756      3057341      4096.00
       4.367     0.999780      3057427      4551.11
       4.399     0.999805      3057493      5120.00
       4.451     0.999829      3057563      5851.43
       4.523     0.999854      3057642      6826.67
       4.603     0.999878      3057714      8192.00
       4.659     0.999890      3057756      9102.22
       4.707     0.999902      3057787     10240.00
       4.775     0.999915      3057824     11702.86
       4.847     0.999927      3057863     13653.33
       4.923     0.999939      3057900     16384.00
       4.975     0.999945      3057919     18204.44
       5.007     0.999951      3057937     20480.00
       5.099     0.999957      3057956     23405.71
       5.163     0.999963      3057975     27306.67
       5.259     0.999969      3057992     32768.00
       5.343     0.999973      3058002     36408.89
       5.399     0.999976      3058011     40960.00
       5.439     0.999979      3058022     46811.43
       5.503     0.999982      3058031     54613.33
       5.551     0.999985      3058039     65536.00
       5.587     0.999986      3058044     72817.78
       5.651     0.999988      3058048     81920.00
       5.755     0.999989      3058053     93622.86
       5.831     0.999991      3058058    109226.67
       5.899     0.999992      3058062    131072.00
       5.907     0.999993      3058065    145635.56
       5.967     0.999994      3058069    163840.00
       5.967     0.999995      3058069    187245.71
       6.027     0.999995      3058072    218453.33
       6.115     0.999996      3058074    262144.00
       6.147     0.999997      3058075    291271.11
       6.191     0.999997      3058076    327680.00
       6.195     0.999997      3058077    374491.43
       6.319     0.999998      3058079    436906.67
       6.343     0.999998      3058080    524288.00
       6.343     0.999998      3058080    582542.22
       6.367     0.999998      3058081    655360.00
       6.367     0.999999      3058081    748982.86
       6.399     0.999999      3058082    873813.33
       6.543     0.999999      3058083   1048576.00
       6.543     0.999999      3058083   1165084.44
       6.543     0.999999      3058083   1310720.00
       6.543     0.999999      3058083   1497965.71
       6.655     0.999999      3058084   1747626.67
       6.655     1.000000      3058084   2097152.00
       6.655     1.000000      3058084   2330168.89
       6.655     1.000000      3058084   2621440.00
       6.655     1.000000      3058084   2995931.43
       6.903     1.000000      3058085   3495253.33
       6.903     1.000000      3058085          inf
#[Mean    =        1.202, StdDeviation   =        0.611]
#[Max     =        6.900, Total count    =      3058085]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3286738 requests in 2.50m, 210.01MB read
  Socket errors: connect 0, read 24, write 0, timeout 0
Requests/sec:  21908.11
Transfer/sec:      1.40MB